/* eslint-disable */
var areas = {
  'district': [
    {
      'text': '荔湾区',
      'id': '440103'
    },
    {
      'text': '越秀区',
      'id': '440104'
    },
    {
      'text': '海珠区',
      'id': '440105'
    },
    {
      'text': '天河区',
      'id': '440106'
    },
    {
      'text': '白云区',
      'id': '440111'
    },
    {
      'text': '黄埔区',
      'id': '440112'
    },
    {
      'text': '番禺区',
      'id': '440113'
    },
    {
      'text': '花都区',
      'id': '440114'
    },
    {
      'text': '南沙区',
      'id': '440115'
    },
    {
      'text': '萝岗区',
      'id': '440116'
    },
    {
      'text': '从化区',
      'id': '440117'
    },
    {
      'text': '增城区',
      'id': '440118'
    }
  ],
  'street': [
    {
      'text': '沙面街道',
      'id': '440103001'
    },
    {
      'text': '岭南街道',
      'id': '440103002'
    },
    {
      'text': '华林街道',
      'id': '440103003'
    },
    {
      'text': '多宝街道',
      'id': '440103004'
    },
    {
      'text': '昌华街道',
      'id': '440103005'
    },
    {
      'text': '逢源街道',
      'id': '440103006'
    },
    {
      'text': '龙津街道',
      'id': '440103007'
    },
    {
      'text': '金花街道',
      'id': '440103008'
    },
    {
      'text': '彩虹街道',
      'id': '440103009'
    },
    {
      'text': '南源街道',
      'id': '440103010'
    },
    {
      'text': '西村街道',
      'id': '440103011'
    },
    {
      'text': '站前街道',
      'id': '440103012'
    },
    {
      'text': '桥中街道',
      'id': '440103013'
    },
    {
      'text': '白鹤洞街道',
      'id': '440103014'
    },
    {
      'text': '冲口街道',
      'id': '440103015'
    },
    {
      'text': '花地街道',
      'id': '440103016'
    },
    {
      'text': '石围塘街道',
      'id': '440103017'
    },
    {
      'text': '茶滘街道',
      'id': '440103018'
    },
    {
      'text': '东漖街道',
      'id': '440103019'
    },
    {
      'text': '海龙街道',
      'id': '440103020'
    },
    {
      'text': '东沙街道',
      'id': '440103021'
    },
    {
      'text': '中南街道',
      'id': '440103022'
    },
    {
      'text': '洪桥街道',
      'id': '440104001'
    },
    {
      'text': '北京街道',
      'id': '440104003'
    },
    {
      'text': '六榕街道',
      'id': '440104004'
    },
    {
      'text': '流花街道',
      'id': '440104005'
    },
    {
      'text': '光塔街道',
      'id': '440104007'
    },
    {
      'text': '人民街道',
      'id': '440104010'
    },
    {
      'text': '东山街道',
      'id': '440104011'
    },
    {
      'text': '农林街道',
      'id': '440104012'
    },
    {
      'text': '梅花村街道',
      'id': '440104013'
    },
    {
      'text': '黄花岗街道',
      'id': '440104014'
    },
    {
      'text': '华乐街道',
      'id': '440104015'
    },
    {
      'text': '建设街道',
      'id': '440104016'
    },
    {
      'text': '大塘街道',
      'id': '440104017'
    },
    {
      'text': '珠光街道',
      'id': '440104018'
    },
    {
      'text': '大东街道',
      'id': '440104019'
    },
    {
      'text': '白云街道',
      'id': '440104020'
    },
    {
      'text': '登峰街道',
      'id': '440104021'
    },
    {
      'text': '矿泉街道',
      'id': '440104022'
    },
    {
      'text': '赤岗街道',
      'id': '440105001'
    },
    {
      'text': '新港街道',
      'id': '440105002'
    },
    {
      'text': '昌岗街道',
      'id': '440105003'
    },
    {
      'text': '江南中街道',
      'id': '440105004'
    },
    {
      'text': '滨江街道',
      'id': '440105005'
    },
    {
      'text': '素社街道',
      'id': '440105006'
    },
    {
      'text': '海幢街道',
      'id': '440105007'
    },
    {
      'text': '南华西街道',
      'id': '440105008'
    },
    {
      'text': '龙凤街道',
      'id': '440105009'
    },
    {
      'text': '沙园街道',
      'id': '440105010'
    },
    {
      'text': '南石头街道',
      'id': '440105011'
    },
    {
      'text': '凤阳街道',
      'id': '440105012'
    },
    {
      'text': '瑞宝街道',
      'id': '440105013'
    },
    {
      'text': '江海街道',
      'id': '440105014'
    },
    {
      'text': '琶洲街道',
      'id': '440105015'
    },
    {
      'text': '南洲街道',
      'id': '440105016'
    },
    {
      'text': '华洲街道',
      'id': '440105017'
    },
    {
      'text': '官洲街道',
      'id': '440105018'
    },
    {
      'text': '五山街道',
      'id': '440106001'
    },
    {
      'text': '员村街道',
      'id': '440106002'
    },
    {
      'text': '车陂街道',
      'id': '440106003'
    },
    {
      'text': '沙河街道',
      'id': '440106004'
    },
    {
      'text': '石牌街道',
      'id': '440106006'
    },
    {
      'text': '沙东街道',
      'id': '440106007'
    },
    {
      'text': '天河南街道',
      'id': '440106008'
    },
    {
      'text': '林和街道',
      'id': '440106009'
    },
    {
      'text': '兴华街道',
      'id': '440106010'
    },
    {
      'text': '棠下街道',
      'id': '440106011'
    },
    {
      'text': '天园街道',
      'id': '440106012'
    },
    {
      'text': '猎德街道',
      'id': '440106013'
    },
    {
      'text': '冼村街道',
      'id': '440106014'
    },
    {
      'text': '元岗街道',
      'id': '440106015'
    },
    {
      'text': '黄村街道',
      'id': '440106016'
    },
    {
      'text': '长兴街道',
      'id': '440106017'
    },
    {
      'text': '龙洞街道',
      'id': '440106018'
    },
    {
      'text': '凤凰街道',
      'id': '440106019'
    },
    {
      'text': '前进街道',
      'id': '440106020'
    },
    {
      'text': '珠吉街道',
      'id': '440106021'
    },
    {
      'text': '新塘街道',
      'id': '440106022'
    },
    {
      'text': '三元里街道',
      'id': '440111002'
    },
    {
      'text': '松洲街道',
      'id': '440111003'
    },
    {
      'text': '景泰街道',
      'id': '440111004'
    },
    {
      'text': '同德街道',
      'id': '440111005'
    },
    {
      'text': '黄石街道',
      'id': '440111006'
    },
    {
      'text': '棠景街道',
      'id': '440111007'
    },
    {
      'text': '新市街道',
      'id': '440111008'
    },
    {
      'text': '同和街道',
      'id': '440111009'
    },
    {
      'text': '京溪街道',
      'id': '440111010'
    },
    {
      'text': '永平街道',
      'id': '440111011'
    },
    {
      'text': '嘉禾街道',
      'id': '440111012'
    },
    {
      'text': '均禾街道',
      'id': '440111013'
    },
    {
      'text': '石井街道',
      'id': '440111014'
    },
    {
      'text': '金沙街道',
      'id': '440111015'
    },
    {
      'text': '人和镇',
      'id': '440111103'
    },
    {
      'text': '太和镇',
      'id': '440111107'
    },
    {
      'text': '钟落潭镇',
      'id': '440111108'
    },
    {
      'text': '江高镇',
      'id': '440111113'
    },
    {
      'text': '黄埔街道',
      'id': '440112001'
    },
    {
      'text': '红山街道',
      'id': '440112002'
    },
    {
      'text': '鱼珠街道',
      'id': '440112003'
    },
    {
      'text': '大沙街道',
      'id': '440112005'
    },
    {
      'text': '文冲街道',
      'id': '440112006'
    },
    {
      'text': '穗东街道',
      'id': '440112007'
    },
    {
      'text': '南岗街道',
      'id': '440112008'
    },
    {
      'text': '荔联街道',
      'id': '440112009'
    },
    {
      'text': '长洲街道',
      'id': '440112010'
    },
    {
      'text': '市桥街道',
      'id': '440113007'
    },
    {
      'text': '沙头街道',
      'id': '440113008'
    },
    {
      'text': '东环街道',
      'id': '440113009'
    },
    {
      'text': '桥南街道',
      'id': '440113010'
    },
    {
      'text': '小谷围街道',
      'id': '440113011'
    },
    {
      'text': '大石街道',
      'id': '440113012'
    },
    {
      'text': '洛浦街道',
      'id': '440113013'
    },
    {
      'text': '石壁街道',
      'id': '440113014'
    },
    {
      'text': '钟村街道',
      'id': '440113015'
    },
    {
      'text': '大龙街道',
      'id': '440113016'
    },
    {
      'text': '南村镇',
      'id': '440113102'
    },
    {
      'text': '新造镇',
      'id': '440113103'
    },
    {
      'text': '化龙镇',
      'id': '440113104'
    },
    {
      'text': '石楼镇',
      'id': '440113105'
    },
    {
      'text': '沙湾镇',
      'id': '440113118'
    },
    {
      'text': '石基镇',
      'id': '440113120'
    },
    {
      'text': '新华街道',
      'id': '440114001'
    },
    {
      'text': '梯面镇',
      'id': '440114103'
    },
    {
      'text': '花山镇',
      'id': '440114104'
    },
    {
      'text': '花东镇',
      'id': '440114105'
    },
    {
      'text': '炭步镇',
      'id': '440114107'
    },
    {
      'text': '赤坭镇',
      'id': '440114108'
    },
    {
      'text': '狮岭镇',
      'id': '440114109'
    },
    {
      'text': '雅瑶镇',
      'id': '440114111'
    },
    {
      'text': '南沙街道',
      'id': '440115001'
    },
    {
      'text': '珠江街道',
      'id': '440115002'
    },
    {
      'text': '龙穴街道',
      'id': '440115003'
    },
    {
      'text': '万顷沙镇',
      'id': '440115100'
    },
    {
      'text': '横沥镇',
      'id': '440115101'
    },
    {
      'text': '黄阁镇',
      'id': '440115102'
    },
    {
      'text': '东涌镇',
      'id': '440115103'
    },
    {
      'text': '大岗镇',
      'id': '440115104'
    },
    {
      'text': '榄核镇',
      'id': '440115105'
    },
    {
      'text': '夏港街道',
      'id': '440116001'
    },
    {
      'text': '萝岗街道',
      'id': '440116002'
    },
    {
      'text': '东区街道',
      'id': '440116003'
    },
    {
      'text': '联和街道',
      'id': '440116004'
    },
    {
      'text': '永和街道',
      'id': '440116005'
    },
    {
      'text': '九龙镇',
      'id': '440116101'
    },
    {
      'text': '街口街道',
      'id': '440117001'
    },
    {
      'text': '江埔街道',
      'id': '440117002'
    },
    {
      'text': '城郊街道',
      'id': '440117003'
    },
    {
      'text': '温泉镇',
      'id': '440117103'
    },
    {
      'text': '良口镇',
      'id': '440117104'
    },
    {
      'text': '吕田镇',
      'id': '440117107'
    },
    {
      'text': '太平镇',
      'id': '440117111'
    },
    {
      'text': '鳌头镇',
      'id': '440117113'
    },
    {
      'text': '流溪河林场',
      'id': '440117402'
    },
    {
      'text': '黄龙带水库管理处',
      'id': '440117404'
    },
    {
      'text': '大岭山林场',
      'id': '440117405'
    },
    {
      'text': '荔城街道',
      'id': '440118001'
    },
    {
      'text': '增江街道',
      'id': '440118002'
    },
    {
      'text': '朱村街道',
      'id': '440118003'
    },
    {
      'text': '永宁街道',
      'id': '440118004'
    },
    {
      'text': '新塘镇',
      'id': '440118101'
    },
    {
      'text': '石滩镇',
      'id': '440118102'
    },
    {
      'text': '中新镇',
      'id': '440118103'
    },
    {
      'text': '正果镇',
      'id': '440118104'
    },
    {
      'text': '派潭镇',
      'id': '440118105'
    },
    {
      'text': '小楼镇',
      'id': '440118106'
    },
    {
      'text': '仙村镇',
      'id': '440118107'
    }
  ]
}

export {areas}
